---
kind: type
id: T:Autodesk.Revit.UI.IExternalCommand
source: html/ad99887e-db50-bf8f-e4e6-2fb86082b5fb.htm
---
# Autodesk.Revit.UI.IExternalCommand

An interface that should be implemented to provide the implementation for a Revit add-in External Command.

## Syntax (C#)
```csharp
public interface IExternalCommand
```

## Remarks
To add an external command to Autodesk Revit the developer should implement an object
that supports the IExternalCommand interface.